## Panda basics notes from book Python for Data Analysis
To get a detailed notes an tutorial please read this book and refer to https://github.com/wesm/pydata-book

In [1]:
# Use SHIFT-ENTER to run each cell.
# CTRL-s to save 
# Enter to edit the cell
import pandas as pd
import numpy as np

In [2]:
# Create a single dimentional array with pandas
# This is also known as a Series in pandas.
obj = pd.Series([4,-7,-5,3])
print(f'first column is default index')
print(f'second column are the values')
print(obj)
print(f'\nTo get only the values run obj.values')
print(obj.values)

first column is default index
second column are the values
0    4
1   -7
2   -5
3    3
dtype: int64

To get only the values run obj.values
[ 4 -7 -5  3]

In [3]:
# Assign a custom index to the panda series
obj2= pd.Series([4,-7,-5,3], index=[100,200,300,400])
obj2

100    4
200   -7
300   -5
400    3
dtype: int64

In [4]:
# To get a row corresponding to a particular
# use array construct as below.
obj2[200]

-7

In [5]:
# Take a exponential of pandas series object.
np.exp(obj2)

100    54.598150
200     0.000912
300     0.006738
400    20.085537
dtype: float64

In [6]:
# Create a series from dict
sdata = {"a":1234,"b":222,"c":98}
data = pd.Series(sdata)
data

a    1234
b     222
c      98
dtype: int64

In [7]:
# Reassign the indexes in a different order.
indexes = ["b","c","d","a"]
data = pd.Series(sdata,index=indexes)
data

b     222.0
c      98.0
d       NaN
a    1234.0
dtype: float64

In [8]:
#assign new indexes
data.index = ["calif","ohio","texas","ny"]
data

calif     222.0
ohio       98.0
texas       NaN
ny       1234.0
dtype: float64

In [9]:
#reindex
data = data.reindex(["ny","ohio","calif","texas","ny"])
data

ny       1234.0
ohio       98.0
calif     222.0
texas       NaN
ny       1234.0
dtype: float64

In [10]:
# create a dataframe from python dictionary.
data = {'state':['ohio','ohio','ohio','nevada','nevada','nevada','ca'], 
       'year':[2000,2001,2002,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2,4.4]}
frame= pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2002  2.4
4  nevada  2001  2.9
5  nevada  2002  3.2
6      ca  2003  4.4

In [11]:
# Rearrange based on columns.
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2002  nevada  2.4
4  2001  nevada  2.9
5  2002  nevada  3.2
6  2003      ca  4.4

In [12]:
#Reassign indexes in a dataframe
frame2 = pd.DataFrame(data,
                      columns=['year','state','pop'],
                      index=['one','two','three','four','five','six','s7'])
frame2

       year   state  pop
one    2000    ohio  1.5
two    2001    ohio  1.7
three  2002    ohio  3.6
four   2002  nevada  2.4
five   2001  nevada  2.9
six    2002  nevada  3.2
s7     2003      ca  4.4

In [13]:
#Get the column state.
print (f'get column with name "state" =>\n {frame2["state"]}')
print (f'get values of col "state" =>\n {frame2["state"].values}')

get column with name "state" =>
 one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
s7           ca
Name: state, dtype: object
get values of col "state" =>
 ['ohio' 'ohio' 'ohio' 'nevada' 'nevada' 'nevada' 'ca']

In [14]:
#Get row by index name
frame2.loc['five']

year       2001
state    nevada
pop         2.9
Name: five, dtype: object

In [15]:
#Get row by index number, 5th row has a index of 4 (starting from 0)
frame2.iloc[4]

year       2001
state    nevada
pop         2.9
Name: five, dtype: object

In [16]:
# Add a new column to Data frame.
frame2['debt'] = np.arange(7.)
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2002  nevada  2.4   3.0
five   2001  nevada  2.9   4.0
six    2002  nevada  3.2   5.0
s7     2003      ca  4.4   6.0

In [17]:
# get indexes
print( f' indexes frame.index =>\n {frame2.index}')
print( f' columns frame.columns =>\n {frame2.columns}')

 indexes frame.index =>
 Index(['one', 'two', 'three', 'four', 'five', 'six', 's7'], dtype='object')
 columns frame.columns =>
 Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [18]:
val = pd.Series([1.2,-1.5,-1.7],index=[100,200,300])
val

100    1.2
200   -1.5
300   -1.7
dtype: float64

In [19]:
index = val.index
index

Int64Index([100, 200, 300], dtype='int64')

In [20]:
# Reindex the data
obj2 = val.reindex([300,200,100,50])
obj2

300   -1.7
200   -1.5
100    1.2
50     NaN
dtype: float64

In [21]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [22]:
# drop a index
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [23]:
data = {'state':['ohio','ohio','ohio','nevada','nevada','nevada','ca'], 
       'year':[2000,2001,2002,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2,4.4]}
frame2 = pd.DataFrame(data,columns=['year','state','pop'],
                      index=['one','two','three','four','five','six','s7'])
# Give a name to index and column
frame2.index.name='numbers'
frame2.columns.name = 'my_columns'
frame2

my_columns  year   state  pop
numbers
one         2000    ohio  1.5
two         2001    ohio  1.7
three       2002    ohio  3.6
four        2002  nevada  2.4
five        2001  nevada  2.9
six         2002  nevada  3.2
s7          2003      ca  4.4

In [24]:
# Drop a row with index 'two'
frame2.drop('two')

my_columns  year   state  pop
numbers
one         2000    ohio  1.5
three       2002    ohio  3.6
four        2002  nevada  2.4
five        2001  nevada  2.9
six         2002  nevada  3.2
s7          2003      ca  4.4

In [25]:
# Drop a column with name 'year' axis=1 means column
frame2.drop('year',axis=1)

my_columns   state  pop
numbers
one           ohio  1.5
two           ohio  1.7
three         ohio  3.6
four        nevada  2.4
five        nevada  2.9
six         nevada  3.2
s7              ca  4.4

In [26]:
# Drop state in place 
frame2.drop('state',axis=1,inplace=True)
frame2

my_columns  year  pop
numbers
one         2000  1.5
two         2001  1.7
three       2002  3.6
four        2002  2.4
five        2001  2.9
six         2002  3.2
s7          2003  4.4

In [27]:
data = {'state':['ohio','ohio','ohio','nevada','nevada','nevada','ca'], 
       'year':[2000,2001,2002,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2,4.4]}
frame2 = pd.DataFrame(data,columns=['year','state','pop'],
                      index=['one','two','three','four','five','six','s7'])
# Get a columns and indexes 
print(f'Indexes => {frame2.index}')
print(f'Columns => {frame2.columns}')

Indexes => Index(['one', 'two', 'three', 'four', 'five', 'six', 's7'], dtype='object')
Columns => Index(['year', 'state', 'pop'], dtype='object')

In [28]:
data = {'state':['ohio','alaska','dakota','kansas','montena','nevada','ca'], 
       'year':[2000,2001,2002,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2,4.4]}

frame2 = pd.DataFrame(data,
                      columns=['year','state','pop'],
                      index=['one','two','three','four','five','six','s7'])

# Display indexes from one through four, labels behaves differently than normal
# python slicing in that the endpoint is inclusive
frame2['one':'four']

       year   state  pop
one    2000    ohio  1.5
two    2001  alaska  1.7
three  2002  dakota  3.6
four   2002  kansas  2.4

In [29]:
# get second row and first column by index.
frame2.iloc[2,[1]]

state    dakota
Name: three, dtype: object

In [30]:
# Get the row by index label and column by column name
frame2.loc['one',['year','state']]

year     2000
state    ohio
Name: one, dtype: object

In [31]:
# Example of outer join.
s1= pd.Series([1.1,2.2,3.3],index=['a','b','c'])
s2= pd.Series([10.01,20.02,30.03,40.04],index=['a','b','c','d'])

# Any non-overlap indexes will be NaN, Same logic also applies to DataFrame
s1 + s2

a    11.11
b    22.22
c    33.33
d      NaN
dtype: float64

In [32]:
# Example of outer join.
s1= pd.Series([1.1,2.2,3.3],index=['a','b','c'])
s2= pd.Series([10.01,20.02,30.03,40.04],index=['a','b','c','d'])

# Fill the missing values with some default. 
# for example 'd' for s1 will be default 4.4 so the result = 4.4 + 40.04 = 44.44
# 
s1.add(s2,fill_value=4.4)

a    11.11
b    22.22
c    33.33
d    44.44
dtype: float64

In [33]:
# applying a special function to data frame
frame2 = pd.DataFrame(np.array(
    [[1,2,3],
     [4,5,6],
     [7,8,9],
     [10,11,12],
     [13,14,15],
    ]
    ),columns=['col1','col2','col3'],
                      index=['one','two','three','four','five'])
print(frame2)

       col1  col2  col3
one       1     2     3
two       4     5     6
three     7     8     9
four     10    11    12
five     13    14    15

In [34]:
# Finding max along column for each row
f = lambda x: x.max()
frame2.apply(f, axis='columns')

one       3
two       6
three     9
four     12
five     15
dtype: int64

In [35]:
# Finding max along index(row) for each column
f = lambda x: x.max()
frame2.apply(f, axis='index')

col1    13
col2    14
col3    15
dtype: int64

In [36]:
## Add 10 to all the columns
add_ten = lambda x: x+10
print("\nAdding 10 to all the columns")
frame2.apply(add_ten, axis='columns')

Adding 10 to all the columns

       col1  col2  col3
one      11    12    13
two      14    15    16
three    17    18    19
four     20    21    22
five     23    24    25

In [37]:
# sorting
frame2 = pd.DataFrame(np.array(
    [[1,2,3],
     [4,5,6],
     [7,8,9],
     [10,11,12],
     [13,14,15],
    ]
    ),columns=['col3','col2','col1'],
                      index=['1','5','3','2','4'])

print("Sort by row")
print(frame2.sort_index())
print("Sort by column")
print(frame2.sort_index(axis=1))

Sort by row
   col3  col2  col1
1     1     2     3
2    10    11    12
3     7     8     9
4    13    14    15
5     4     5     6
Sort by column
   col1  col2  col3
1     3     2     1
5     6     5     4
3     9     8     7
2    12    11    10
4    15    14    13

In [38]:
# Sum along rows and columns
print("Sum along row")
frame2.sum()
print("Sum along col")
frame2.sum(axis='columns')

Sum along row
Sum along col

1     6
5    15
3    24
2    33
4    42
dtype: int64

In [39]:
# Get a brief statistics 
frame2.describe()

            col3       col2       col1
count   5.000000   5.000000   5.000000
mean    7.000000   8.000000   9.000000
std     4.743416   4.743416   4.743416
min     1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000
50%     7.000000   8.000000   9.000000
75%    10.000000  11.000000  12.000000
max    13.000000  14.000000  15.000000

In [40]:
#Drop missing data with panda Series
from numpy import nan as NA
data = pd.Series([1,NA,3.2,NA,NA,5])
print(data)
print("\ndropn NA's data.dropna()")
data.dropna()

0    1.0
1    NaN
2    3.2
3    NaN
4    NaN
5    5.0
dtype: float64

dropn NA's data.dropna()

0    1.0
2    3.2
5    5.0
dtype: float64

In [41]:
# Drop missing data with panda data frame
from numpy import nan as NA
data = pd.DataFrame([
    [1, NA,2 ,NA,NA, 3],
    [4, 5, 6 , 7, 7, 8],
    [NA,NA,8 ,NA,NA, 5],
    [NA,NA,NA,NA,NA,NA]
])
print(data)

print("\ndroping all the rows with one or more NA's")
print(data.dropna())

print("\ndroping the rows with all NA's")
print(data.dropna(how="all"))

print("\ndroping the rows with threshold=2")
print(data.dropna(thresh=2))

     0    1    2    3    4    5
0  1.0  NaN  2.0  NaN  NaN  3.0
1  4.0  5.0  6.0  7.0  7.0  8.0
2  NaN  NaN  8.0  NaN  NaN  5.0
3  NaN  NaN  NaN  NaN  NaN  NaN

droping all the rows with one or more NA's
     0    1    2    3    4    5
1  4.0  5.0  6.0  7.0  7.0  8.0

droping the rows with all NA's
     0    1    2    3    4    5
0  1.0  NaN  2.0  NaN  NaN  3.0
1  4.0  5.0  6.0  7.0  7.0  8.0
2  NaN  NaN  8.0  NaN  NaN  5.0

droping the rows with threshold=2
     0    1    2    3    4    5
0  1.0  NaN  2.0  NaN  NaN  3.0
1  4.0  5.0  6.0  7.0  7.0  8.0
2  NaN  NaN  8.0  NaN  NaN  5.0

In [42]:
# Fill missing data with panda data frame
from numpy import nan as NA
data = pd.DataFrame([
    [1, NA,2 ,NA,NA, 3],
    [4, 5, 6 , 7, 7, 8],
    [NA,NA,8 ,NA,NA, 5],
    [NA,NA,NA,NA,NA,NA]
])
print(data)

print("\nFill missing NA with 100")
print(data.fillna(100))

print("\n Replace all 7 and 5 with 777,555 ")
print(data.replace([7,5],[777,555]))

     0    1    2    3    4    5
0  1.0  NaN  2.0  NaN  NaN  3.0
1  4.0  5.0  6.0  7.0  7.0  8.0
2  NaN  NaN  8.0  NaN  NaN  5.0
3  NaN  NaN  NaN  NaN  NaN  NaN

Fill missing NA with 100
       0      1      2      3      4      5
0    1.0  100.0    2.0  100.0  100.0    3.0
1    4.0    5.0    6.0    7.0    7.0    8.0
2  100.0  100.0    8.0  100.0  100.0    5.0
3  100.0  100.0  100.0  100.0  100.0  100.0

 Replace all 7 and 5 with 777,555
     0      1    2      3      4      5
0  1.0    NaN  2.0    NaN    NaN    3.0
1  4.0  555.0  6.0  777.0  777.0    8.0
2  NaN    NaN  8.0    NaN    NaN  555.0
3  NaN    NaN  NaN    NaN    NaN    NaN

In [43]:
# Bucketize the inputs
ages = [20,22,25,31,34,45,48,55,61,65,75]
bins =[19,25,35,60,100]
cats = pd.cut(ages,bins)
print( "number of groups")
print(cats.categories)
print( "number in each group")
print(pd.value_counts(cats))

number of groups
IntervalIndex([(19, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')
number in each group
(60, 100]    3
(35, 60]     3
(19, 25]     3
(25, 35]     2
dtype: int64

In [44]:
# Hierarchical indexing
data = pd.Series([100,200,300,400,500],
                 index=[['a','a','b','b','c'],[1,2,3,1,2]])
print(data)
print(data.index)

a  1    100
   2    200
b  3    300
   1    400
c  2    500
dtype: int64
MultiIndex(levels=[['a', 'b', 'c'], [1, 2, 3]],
           labels=[[0, 0, 1, 1, 2], [0, 1, 2, 0, 1]])

In [45]:
# accesing data with for a
x = data['a']
print(f"data for 'a' => {x}")
x = data.loc[:,[2]]
print(f"data for '[2]' =>\n{x}")

data for 'a' => 1    100
2    200
dtype: int64
data for '[2]' =>
a  2    200
c  2    500
dtype: int64

In [46]:
data.unstack()

       1      2      3
a  100.0  200.0    NaN
b  400.0    NaN  300.0
c    NaN  500.0    NaN